
### Урок: Печать бейджиков участников олимпиады

#### Цель урока:
Научиться писать программу, которая запрашивает количество участников и печатает бейджики для каждого участника.

#### Инструменты, которые понадобятся:
1. **Функции**
2. **Циклы**
3. **Ввод и вывод данных**
4. **Форматирование строк**

#### Примеры и объяснения:

1. **Функции**
   Функции позволяют нам группировать код в блоки, которые можно вызывать многократно. Это помогает организовать код и делает его более читаемым.

   Пример функции:
   ```python
   def приветствие():
       print("Добро пожаловать на олимпиаду!")

   приветствие()
   ```

2. **Циклы**
   Циклы позволяют нам повторять блоки кода несколько раз. В нашем случае мы будем использовать цикл `for` для печати бейджиков для каждого участника.

   Пример цикла:
   ```python
   for i in range(3):
       print(f"Бейдж участника {i+1}")
   ```

3. **Ввод и вывод данных**
   Мы будем использовать функцию `input()` для запроса количества участников и функцию `print()` для вывода бейджиков.

   Пример ввода и вывода:
   ```python
   количество_участников = int(input("Введите количество участников: "))
   print(f"Количество участников: {количество_участников}")
   ```

4. **Форматирование строк**
   Форматирование строк позволяет нам вставлять переменные в строки. Мы будем использовать f-строки для этого.

   Пример форматирования строк:
   ```python
   имя = "Иван"
   школа = "Школа №1"
   print(f"Имя: {имя}\nШкола: {школа}")
   ```

#### Задание:
Напишите программу, которая запрашивает количество участников и печатает бейджики для каждого участника. Бейдж должен содержать название олимпиады: «-Золотое пёрышко-», поле для имени: «Имя: ____» и поле для школы: «Школа: ____». В завершении программа должна печатать: «Готово! Заберите бейджики.»

Пример вывода программы:
```
Введите количество участников: 3
-Золотое пёрышко-
Имя: ____
Школа: ____

-Золотое пёрышко-
Имя: ____
Школа: ____

-Золотое пёрышко-
Имя: ____
Школа: ____

Готово! Заберите бейджики.
```

#### Подсказки:
1. Используйте функцию для печати одного бейджика.
2. Используйте цикл для печати бейджиков для всех участников.
3. Не забудьте запросить количество участников у пользователя.

Удачи!
